Revit 2024 API
Color.IsValid Property
Identifies if the color represents a valid color, or an uninitialized/invalid value.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2012
Syntax
C#
public bool IsValid { get; }
Visual Basic
Public ReadOnly Property IsValid As Boolean
	Get
Visual C++
public:
property bool IsValid {
	bool get ();
}
See Also
Color Class
Autodesk.Revit.DB Namespace